#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.tenant["tenant1"].data.terraform_remote_state.platform: Reading...
module.tenant["tenant4"].data.terraform_remote_state.platform: Reading...
module.tenant["tenant4"].data.terraform_remote_state.platform: Read complete after 0s
module.tenant["tenant1"].data.terraform_remote_state.platform: Read complete after 0s
module.tenant["customer2"].azurerm_resource_group.crgar-aca-dev-tenant-rg: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg]
module.tenant["customer1"].azurerm_resource_group.crgar-aca-dev-tenant-rg: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg]
module.tenant["customer2"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer2-aca-env]
module.tenant["customer1"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer1-aca-env]
module.tenant["customer2"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer2st]
module.tenant["customer1"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer1st]
module.tenant["customer2"].module.aca.azurerm_container_app.crgar-aca-demo-app: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-customer2-aca-app]
module.tenant["customer1"].module.aca.azurerm_container_app.crgar-aca-demo-app: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-customer1-aca-app]
module.tenant["customer1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share: Refreshing state... [id=https://crgaracadevcustomer1st.file.core.windows.net/mounted-share]
module.tenant["customer2"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share: Refreshing state... [id=https://crgaracadevcustomer2st.file.core.windows.net/mounted-share]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.tenant["customer1"].azurerm_resource_group.crgar-aca-dev-tenant-rg will be destroyed
  # (because module.tenant["customer1"] is not in configuration)
  - resource "azurerm_resource_group" "crgar-aca-dev-tenant-rg" {
      - id         = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg" -> null
      - location   = "swedencentral" -> null
      - name       = "crgar-aca-dev-customer1-rg" -> null
      - tags       = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer1"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.tenant["customer2"].azurerm_resource_group.crgar-aca-dev-tenant-rg will be destroyed
  # (because module.tenant["customer2"] is not in configuration)
  - resource "azurerm_resource_group" "crgar-aca-dev-tenant-rg" {
      - id         = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg" -> null
      - location   = "swedencentral" -> null
      - name       = "crgar-aca-dev-customer2-rg" -> null
      - tags       = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer2"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.tenant["tenant1"].azurerm_resource_group.crgar-aca-dev-tenant-rg will be created
  + resource "azurerm_resource_group" "crgar-aca-dev-tenant-rg" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "crgar-aca-dev-tenant1-rg"
      + tags     = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }
    }

  # module.tenant["tenant4"].azurerm_resource_group.crgar-aca-dev-tenant-rg will be created
  + resource "azurerm_resource_group" "crgar-aca-dev-tenant-rg" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "crgar-aca-dev-tenant4-rg"
      + tags     = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }
    }

  # module.tenant["customer1"].module.aca.azurerm_container_app.crgar-aca-demo-app will be destroyed
  # (because module.tenant["customer1"].module.aca is not in configuration)
  - resource "azurerm_container_app" "crgar-aca-demo-app" {
      - container_app_environment_id  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer1-aca-env" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-customer1-aca-app" -> null
      - latest_revision_fqdn          = "crgar-aca-dev-customer1-aca-app--004.ambitiousmoss-3da1a1ad.swedencentral.azurecontainerapps.io" -> null
      - latest_revision_name          = "crgar-aca-dev-customer1-aca-app--004" -> null
      - location                      = "swedencentral" -> null
      - name                          = "crgar-aca-dev-customer1-aca-app" -> null
      - outbound_ip_addresses         = [
          - "74.241.236.29",
        ] -> null
      - resource_group_name           = "crgar-aca-dev-customer1-rg" -> null
      - revision_mode                 = "Multiple" -> null
      - tags                          = {
          - "environment_name" = "dev"
          - "revision"         = "004"
          - "tenant_name"      = "customer1"
        } -> null
        # (1 unchanged attribute hidden)

      - identity {
          - identity_ids = [
              - "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity",
            ] -> null
          - principal_id = "bfb3fc7d-3ec1-435b-a48d-2c3e3a51faf4" -> null
          - tenant_id    = "b317d745-eb97-4068-9a14-a2e967b0b72e" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }

      - ingress {
          - allow_insecure_connections = true -> null
          - custom_domain              = [] -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "crgar-aca-dev-customer1-aca-app.ambitiousmoss-3da1a1ad.swedencentral.azurecontainerapps.io" -> null
          - target_port                = 8080 -> null
          - transport                  = "auto" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - registry {
          - identity             = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity" -> null
          - server               = "crgaracadevplatformacr.azurecr.io" -> null
            # (2 unchanged attributes hidden)
        }

      - template {
          - max_replicas    = 3 -> null
          - min_replicas    = 1 -> null
          - revision_suffix = "004" -> null

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.25 -> null
              - ephemeral_storage = "1Gi" -> null
              - image             = "crgaracadevplatformacr.azurecr.io/webapp:004" -> null
              - memory            = "0.5Gi" -> null
              - name              = "processor" -> null

              - env {
                  - name        = "TENANT_NAME" -> null
                  - value       = "customer1" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "ENVIRONMENT_NAME" -> null
                  - value       = "dev" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "TIER" -> null
                  - value       = "basic" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # module.tenant["customer1"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env will be destroyed
  # (because module.tenant["customer1"].module.aca is not in configuration)
  - resource "azurerm_container_app_environment" "crgar-aca-demo-tenant-env" {
      - custom_domain_verification_id               = "45B89AFE0D2AE53DBBD5B0AFCAD454D5D9C1DAF3CDCDEB1C0B6D2E95841280DB" -> null
      - default_domain                              = "ambitiousmoss-3da1a1ad.swedencentral.azurecontainerapps.io" -> null
      - id                                          = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer1-aca-env" -> null
      - internal_load_balancer_enabled              = false -> null
      - location                                    = "swedencentral" -> null
      - log_analytics_workspace_id                  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.OperationalInsights/workspaces/crgar-aca-dev-platform-law" -> null
      - mutual_tls_enabled                          = false -> null
      - name                                        = "crgar-aca-dev-customer1-aca-env" -> null
      - resource_group_name                         = "crgar-aca-dev-customer1-rg" -> null
      - static_ip_address                           = "4.225.95.46" -> null
      - tags                                        = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer1"
        } -> null
      - zone_redundancy_enabled                     = false -> null
        # (6 unchanged attributes hidden)
    }

  # module.tenant["customer1"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage will be destroyed
  # (because module.tenant["customer1"].module.storage is not in configuration)
  - resource "azurerm_storage_account" "crgar-aca-demo-tenant-storage" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer1st" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "swedencentral" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "crgaracadevcustomer1st" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://crgaracadevcustomer1st.blob.core.windows.net/" -> null
      - primary_blob_host                  = "crgaracadevcustomer1st.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://crgaracadevcustomer1st.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "crgaracadevcustomer1st.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://crgaracadevcustomer1st.file.core.windows.net/" -> null
      - primary_file_host                  = "crgaracadevcustomer1st.file.core.windows.net" -> null
      - primary_location                   = "swedencentral" -> null
      - primary_queue_endpoint             = "https://crgaracadevcustomer1st.queue.core.windows.net/" -> null
      - primary_queue_host                 = "crgaracadevcustomer1st.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://crgaracadevcustomer1st.table.core.windows.net/" -> null
      - primary_table_host                 = "crgaracadevcustomer1st.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://crgaracadevcustomer1st.z1.web.core.windows.net/" -> null
      - primary_web_host                   = "crgaracadevcustomer1st.z1.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "crgar-aca-dev-customer1-rg" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer1"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.tenant["customer1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share will be destroyed
  # (because module.tenant["customer1"].module.storage is not in configuration)
  - resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share" {
      - access_tier          = "TransactionOptimized" -> null
      - enabled_protocol     = "SMB" -> null
      - id                   = "https://crgaracadevcustomer1st.file.core.windows.net/mounted-share" -> null
      - metadata             = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer1"
        } -> null
      - name                 = "mounted-share" -> null
      - quota                = 1 -> null
      - resource_manager_id  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer1-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer1st/fileServices/default/fileshares/mounted-share" -> null
      - storage_account_name = "crgaracadevcustomer1st" -> null
      - url                  = "https://crgaracadevcustomer1st.file.core.windows.net/mounted-share" -> null
    }

  # module.tenant["customer2"].module.aca.azurerm_container_app.crgar-aca-demo-app will be destroyed
  # (because module.tenant["customer2"].module.aca is not in configuration)
  - resource "azurerm_container_app" "crgar-aca-demo-app" {
      - container_app_environment_id  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer2-aca-env" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-customer2-aca-app" -> null
      - latest_revision_fqdn          = "crgar-aca-dev-customer2-aca-app--004.nicegrass-9ba15947.swedencentral.azurecontainerapps.io" -> null
      - latest_revision_name          = "crgar-aca-dev-customer2-aca-app--004" -> null
      - location                      = "swedencentral" -> null
      - name                          = "crgar-aca-dev-customer2-aca-app" -> null
      - outbound_ip_addresses         = [
          - "74.241.140.211",
        ] -> null
      - resource_group_name           = "crgar-aca-dev-customer2-rg" -> null
      - revision_mode                 = "Multiple" -> null
      - tags                          = {
          - "environment_name" = "dev"
          - "revision"         = "004"
          - "tenant_name"      = "customer2"
        } -> null
        # (1 unchanged attribute hidden)

      - identity {
          - identity_ids = [
              - "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity",
            ] -> null
          - principal_id = "ebc10851-ab26-4a1b-8a4f-1c3aa34de1c8" -> null
          - tenant_id    = "b317d745-eb97-4068-9a14-a2e967b0b72e" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }

      - ingress {
          - allow_insecure_connections = true -> null
          - custom_domain              = [] -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "crgar-aca-dev-customer2-aca-app.nicegrass-9ba15947.swedencentral.azurecontainerapps.io" -> null
          - target_port                = 8080 -> null
          - transport                  = "auto" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - registry {
          - identity             = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity" -> null
          - server               = "crgaracadevplatformacr.azurecr.io" -> null
            # (2 unchanged attributes hidden)
        }

      - template {
          - max_replicas    = 3 -> null
          - min_replicas    = 1 -> null
          - revision_suffix = "004" -> null

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.25 -> null
              - ephemeral_storage = "1Gi" -> null
              - image             = "crgaracadevplatformacr.azurecr.io/webapp:004" -> null
              - memory            = "0.5Gi" -> null
              - name              = "processor" -> null

              - env {
                  - name        = "TENANT_NAME" -> null
                  - value       = "customer2" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "ENVIRONMENT_NAME" -> null
                  - value       = "dev" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "TIER" -> null
                  - value       = "premium" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # module.tenant["customer2"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env will be destroyed
  # (because module.tenant["customer2"].module.aca is not in configuration)
  - resource "azurerm_container_app_environment" "crgar-aca-demo-tenant-env" {
      - custom_domain_verification_id               = "45B89AFE0D2AE53DBBD5B0AFCAD454D5D9C1DAF3CDCDEB1C0B6D2E95841280DB" -> null
      - default_domain                              = "nicegrass-9ba15947.swedencentral.azurecontainerapps.io" -> null
      - id                                          = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-customer2-aca-env" -> null
      - internal_load_balancer_enabled              = false -> null
      - location                                    = "swedencentral" -> null
      - log_analytics_workspace_id                  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.OperationalInsights/workspaces/crgar-aca-dev-platform-law" -> null
      - mutual_tls_enabled                          = false -> null
      - name                                        = "crgar-aca-dev-customer2-aca-env" -> null
      - resource_group_name                         = "crgar-aca-dev-customer2-rg" -> null
      - static_ip_address                           = "4.225.198.187" -> null
      - tags                                        = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer2"
        } -> null
      - zone_redundancy_enabled                     = false -> null
        # (6 unchanged attributes hidden)
    }

  # module.tenant["customer2"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage will be destroyed
  # (because module.tenant["customer2"].module.storage is not in configuration)
  - resource "azurerm_storage_account" "crgar-aca-demo-tenant-storage" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer2st" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "swedencentral" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "crgaracadevcustomer2st" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://crgaracadevcustomer2st.blob.core.windows.net/" -> null
      - primary_blob_host                  = "crgaracadevcustomer2st.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://crgaracadevcustomer2st.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "crgaracadevcustomer2st.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://crgaracadevcustomer2st.file.core.windows.net/" -> null
      - primary_file_host                  = "crgaracadevcustomer2st.file.core.windows.net" -> null
      - primary_location                   = "swedencentral" -> null
      - primary_queue_endpoint             = "https://crgaracadevcustomer2st.queue.core.windows.net/" -> null
      - primary_queue_host                 = "crgaracadevcustomer2st.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://crgaracadevcustomer2st.table.core.windows.net/" -> null
      - primary_table_host                 = "crgaracadevcustomer2st.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://crgaracadevcustomer2st.z1.web.core.windows.net/" -> null
      - primary_web_host                   = "crgaracadevcustomer2st.z1.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "crgar-aca-dev-customer2-rg" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer2"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.tenant["customer2"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share will be destroyed
  # (because module.tenant["customer2"].module.storage is not in configuration)
  - resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share" {
      - access_tier          = "TransactionOptimized" -> null
      - enabled_protocol     = "SMB" -> null
      - id                   = "https://crgaracadevcustomer2st.file.core.windows.net/mounted-share" -> null
      - metadata             = {
          - "environment_name" = "dev"
          - "tenant_name"      = "customer2"
        } -> null
      - name                 = "mounted-share" -> null
      - quota                = 1 -> null
      - resource_manager_id  = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-customer2-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevcustomer2st/fileServices/default/fileshares/mounted-share" -> null
      - storage_account_name = "crgaracadevcustomer2st" -> null
      - url                  = "https://crgaracadevcustomer2st.file.core.windows.net/mounted-share" -> null
    }

  # module.tenant["tenant1"].module.aca.azurerm_container_app.crgar-aca-demo-app will be created
  + resource "azurerm_container_app" "crgar-aca-demo-app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "crgar-aca-dev-tenant1-aca-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "crgar-aca-dev-tenant1-rg"
      + revision_mode                 = "Multiple"
      + tags                          = {
          + "environment_name" = "dev"
          + "revision"         = "004"
          + "tenant_name"      = "tenant1"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned, UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = true
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity"
          + server   = "crgaracadevplatformacr.azurecr.io"
        }

      + template {
          + max_replicas    = 3
          + min_replicas    = 1
          + revision_suffix = "004"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "crgaracadevplatformacr.azurecr.io/webapp:004"
              + memory            = "0.5Gi"
              + name              = "processor"

              + env {
                  + name  = "TENANT_NAME"
                  + value = "tenant1"
                }
              + env {
                  + name  = "ENVIRONMENT_NAME"
                  + value = "dev"
                }
              + env {
                  + name  = "TIER"
                  + value = "basic"
                }
            }
        }
    }

  # module.tenant["tenant1"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env will be created
  + resource "azurerm_container_app_environment" "crgar-aca-demo-tenant-env" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "swedencentral"
      + log_analytics_workspace_id       = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.OperationalInsights/workspaces/crgar-aca-dev-platform-law"
      + mutual_tls_enabled               = false
      + name                             = "crgar-aca-dev-tenant1-aca-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "crgar-aca-dev-tenant1-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }
      + zone_redundancy_enabled          = false
    }

  # module.tenant["tenant1"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage will be created
  + resource "azurerm_storage_account" "crgar-aca-demo-tenant-storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = "crgaracadevtenant1st"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "crgar-aca-dev-tenant1-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.tenant["tenant1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }
      + name                 = "mounted-share"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant1st"
      + url                  = (known after apply)
    }

  # module.tenant["tenant1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share2 will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share2" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }
      + name                 = "mounted-share2"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant1st"
      + url                  = (known after apply)
    }

  # module.tenant["tenant4"].module.aca.azurerm_container_app.crgar-aca-demo-app will be created
  + resource "azurerm_container_app" "crgar-aca-demo-app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "crgar-aca-dev-tenant4-aca-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "crgar-aca-dev-tenant4-rg"
      + revision_mode                 = "Multiple"
      + tags                          = {
          + "environment_name" = "dev"
          + "revision"         = "004"
          + "tenant_name"      = "tenant4"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned, UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = true
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/crgar-aca-dev-platform-identity"
          + server   = "crgaracadevplatformacr.azurecr.io"
        }

      + template {
          + max_replicas    = 3
          + min_replicas    = 1
          + revision_suffix = "004"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "crgaracadevplatformacr.azurecr.io/webapp:004"
              + memory            = "0.5Gi"
              + name              = "processor"

              + env {
                  + name  = "TENANT_NAME"
                  + value = "tenant4"
                }
              + env {
                  + name  = "ENVIRONMENT_NAME"
                  + value = "dev"
                }
              + env {
                  + name  = "TIER"
                  + value = "standard"
                }
            }
        }
    }

  # module.tenant["tenant4"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env will be created
  + resource "azurerm_container_app_environment" "crgar-aca-demo-tenant-env" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "swedencentral"
      + log_analytics_workspace_id       = "/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-platform-rg/providers/Microsoft.OperationalInsights/workspaces/crgar-aca-dev-platform-law"
      + mutual_tls_enabled               = false
      + name                             = "crgar-aca-dev-tenant4-aca-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "crgar-aca-dev-tenant4-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }
      + zone_redundancy_enabled          = false
    }

  # module.tenant["tenant4"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage will be created
  + resource "azurerm_storage_account" "crgar-aca-demo-tenant-storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = "crgaracadevtenant4st"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "crgar-aca-dev-tenant4-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.tenant["tenant4"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }
      + name                 = "mounted-share"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant4st"
      + url                  = (known after apply)
    }

  # module.tenant["tenant4"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share2 will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share2" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }
      + name                 = "mounted-share2"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant4st"
      + url                  = (known after apply)
    }

Plan: 12 to add, 0 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @crgarcia12, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infrastructure`*